resources/wales/cav/receivefilebycrn-req.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <ReceiveFileByCrn xmlns="http://localhost/PMSInterfaceWebService">
      <crn>{{crn}}</crn>
      <bfsId>{{bfsId}}</bfsId>
      <key>{{key}}</key>
      <source>{{source}}</source>
      <fileContent>{{fileContent|safe}}</fileContent>
      <fileType>{{fileType}}</fileType>
    </ReceiveFileByCrn>
  </soap:Body>
</soap:Envelope>